app/views/articles/_form.html.erb

      <%= form.label :author_id, "Author" %>
      <% if Author.any? %>
        <%= form.collection_select :author_id, Author.all, :id, :full_name, { prompt: "Select Author" } %>
---
SELECT 1 AS one FROM "authors" LIMIT ?  [["LIMIT", 1]]
SELECT "authors".* FROM "authors"