app/views/articles/_form.html.erb

SELECT "authors".* FROM "authors"
---
      <%= form.label :author_id, "Author" %>
      <%= form.collection_select :author_id, Author.all, :id, :full_name, { prompt: "Select Author" } %>