app/views/articles/show.html.erb


<% if @article.comments.any? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 5]]
SELECT 1 AS one FROM "comments" WHERE "comments"."article_id" = ? LIMIT ?  [["article_id", 2], ["LIMIT", 1]]