app/views/authors/show.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."author_id" = ?  [["author_id", 1]]
SELECT 1 AS one FROM "articles" WHERE "articles"."author_id" = ? LIMIT ?  [["author_id", 5], ["LIMIT", 1]]
---

  <% if @author.articles.any? %>

SELECT "articles".* FROM "articles" WHERE "articles"."author_id" = ?  [["author_id", 1]]
---
    <ul>
      <% @author.articles.each do |article| %>