app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status", "author_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "Article 2"], ["body", "Loro ipsum......"], ["created_at", "2024-05-13 07:26:30.785109"], ["updated_at", "2024-05-13 07:26:30.785109"], ["status", "public"], ["author_id", 1]]

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "New article edited"], ["updated_at", "2024-05-14 15:09:46.078743"], ["id", 5]]