app/controllers/authors_controller.rb

  def index
    @authors = Author.all
---
SELECT "authors".* FROM "authors"

  def show
    @author = Author.find(params[:id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def create
    @author = Author.new(author_params)

    if @author.save
---
INSERT INTO "authors" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["first_name", "rglem,gr"], ["last_name", "ergelglr"], ["email", "milanammk@gmail.com"], ["created_at", "2024-05-14 06:40:36.191670"], ["updated_at", "2024-05-14 06:40:36.191670"]]

  def edit
    @author = Author.find(params[:id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @author = Author.find(params[:id])

    if @author.update(author_params)
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "authors" SET "first_name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["first_name", "Milana увшеув"], ["updated_at", "2024-05-14 18:20:19.155966"], ["id", 9]]

  def destroy
    @author = Author.find(params[:id])
    @author.destroy
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 5]]

    def set_author
      @author = Author.find(params[:id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]